# Pandas Crash Course - Pandas Operations

In [1]:
import numpy as np
import pandas as pd

Creating a dataframe

In [2]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

Getting the unique values from col2

In [3]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

Getting the number of unique values in col2

In [4]:
df['col2'].nunique()

3

Getting the counts of each value in col2

In [5]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

Using multiple conditionals and saving it to newdf

In [7]:
newdf = df[(df['col1'] > 2) & (df['col2'] == 444)]

In [8]:
newdf

   col1  col2 col3
3     4   444  xyz

Creating a basic python function

In [9]:
def times_two(number):
    return number * 2

Creating a new column called new that uses the python function on col1

In [12]:
df['new'] = df['col1'].apply(times_two)

In [13]:
df

   col1  col2 col3  new
0     1   444  abc    2
1     2   555  def    4
2     3   666  ghi    6
3     4   444  xyz    8

Deleting the new column

In [14]:
del df['new']

In [15]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

returning all the columns in the dataframe

In [16]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

Sorting the values in col2

In [17]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi